In [5]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')            #import required libreries

In [11]:
df=pd.read_csv('insurance.csv')             #import file from stored folder

In [12]:
df.head()                                   #Showed 5 data from the file by head function

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [13]:
df.isnull().sum()                          #check is there any null value in DataFrame

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [14]:
df.info()                                   #Information about whole data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [15]:
df.age.mean()                         #Showing the mean value of age

39.20702541106129

In [ ]:
df.bmi.median()                       #Showing the median value of bmi

In [16]:
df.charges.mode()                    #Showing the mode of charges from data table

0    1639.5631
Name: charges, dtype: float64

In [75]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()
df8 = df.copy()
df9 = df.copy()
df10 = df.copy()

# Different way of Encoding

# 1.Label Encoding

In [37]:
from sklearn.preprocessing import LabelEncoder         #import label Encoder from sklearn

In [38]:
le=LabelEncoder()                                      #Assign Label Encoder as le

In [39]:
df1.sex=le.fit_transform(df1['sex'])                  #Transform sex column data by label encoding

In [40]:
df1.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [41]:
df1.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [42]:
#Label encoding by using for loop
for column in df1.columns:
    if df1[column].dtype==np.number:
        continue
    else:
        df1[column]=le.fit_transform(df1[column])

In [43]:
df1.head()

   age  sex     bmi  children  smoker  region      charges
0    1    0  27.900         0       1       3  16884.92400
1    0    1  33.770         1       0       2   1725.55230
2   10    1  33.000         3       0       2   4449.46200
3   15    1  22.705         0       0       1  21984.47061
4   14    1  28.880         0       0       1   3866.85520

Another way using for loop

In [44]:
from pandas.core.dtypes.common import is_numeric_dtype      #check data type for using in foor loop

In [45]:
for column in df2.columns:
    if is_numeric_dtype(df2[column]):
        continue
    df2[column]=le.fit_transform(df2[column])

In [46]:
df2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# 2.One hot Encoding

In [47]:
df3.head()                                #Read data set from df3

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [49]:
dummy=pd.get_dummies(df3['sex'])        #Creating dummy values for sex column

In [50]:
dummy.head()                            #Showing dummy values for male nad female from sex column

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [51]:
df.nunique()                                  #Check unique value of check column.

age           47
sex            2
bmi          548
children       6
smoker         2
region         4
charges     1337
dtype: int64

In [53]:
df3=df3.drop('sex',axis=1)                      #Drop sex columnn for one hot encoding

In [54]:
df3.head()

   age     bmi  children smoker     region      charges
0   19  27.900         0    yes  southwest  16884.92400
1   18  33.770         1     no  southeast   1725.55230
2   28  33.000         3     no  southeast   4449.46200
3   33  22.705         0     no  northwest  21984.47061
4   32  28.880         0     no  northwest   3866.85520

In [55]:
dummy=pd.get_dummies(df4['sex'],drop_first=True)      #Drop female from the sex column
dummy.head()

   male
0     0
1     1
2     1
3     1
4     1

In [56]:
new_df=pd.concat([df3,dummy],axis=1)                 #Concat dummy and df3

In [57]:
new_df.head()

   age     bmi  children smoker     region      charges  male
0   19  27.900         0    yes  southwest  16884.92400     0
1   18  33.770         1     no  southeast   1725.55230     1
2   28  33.000         3     no  southeast   4449.46200     1
3   33  22.705         0     no  northwest  21984.47061     1
4   32  28.880         0     no  northwest   3866.85520     1

In [76]:
#One hot Encoding using for loop

for col in df5.columns:
    if is_numeric_dtype(df5[col]):
        continue
    #pre=['sex','smoker','region']
    one = pd.get_dummies(df5[col],drop_first=True)
    df5.drop(df5[[col]], axis=1, inplace=True)
    df5=pd.concat([df5,one], axis=1)
df5.head()

,age,bmi,children,charges,male,yes,northwest,southeast,southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# 3.Ordinal Encoder

In [77]:
df6.head()                                            #Read data from df6 for ordinal encoder

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [78]:
from sklearn.preprocessing import OrdinalEncoder       #Import required librery

In [79]:
df6.sex.unique()

array(['female', 'male'], dtype=object)

In [80]:
sex=['female', 'male']                              #Creating list for ordinal encoder in sex column

In [85]:
ordinal=OrdinalEncoder(categories=[sex])
encoded=ordinal.fit_transform(df6[['sex']])         #transform and fit data by ordinal encoding

In [87]:
encoded

array([[0.],
       [1.],
       [1.],
       ...,
       [0.],
       [0.],
       [0.]])

In [88]:
new_sex=pd.DataFrame(encoded,columns=['sex'])         #creating data frame from encoded values

In [89]:
new_sex.head()

   sex
0  0.0
1  1.0
2  1.0
3  1.0
4  1.0

In [90]:
df7.sex=new_sex                                       #replace df7 by new data

In [91]:
df7.head()

   age  sex     bmi  children smoker     region      charges
0   19  0.0  27.900         0    yes  southwest  16884.92400
1   18  1.0  33.770         1     no  southeast   1725.55230
2   28  1.0  33.000         3     no  southeast   4449.46200
3   33  1.0  22.705         0     no  northwest  21984.47061
4   32  1.0  28.880         0     no  northwest   3866.85520

In [92]:
#Using for loop
cols = ['sex','smoker','region']
for col in cols:
    unique = df8[col].unique()
    df8[col] = OrdinalEncoder(categories=[unique]).fit_transform(df8[[col]])

In [93]:
df8.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520

# 4.Replace Method

In [94]:
df9.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [96]:
df9.sex.unique()

array(['female', 'male'], dtype=object)

In [97]:
df9.sex=df9.sex.replace(['female','male'],[1,2])

In [98]:
df9.head()

   age  sex     bmi  children smoker     region      charges
0   19    1  27.900         0    yes  southwest  16884.92400
1   18    2  33.770         1     no  southeast   1725.55230
2   28    2  33.000         3     no  southeast   4449.46200
3   33    2  22.705         0     no  northwest  21984.47061
4   32    2  28.880         0     no  northwest   3866.85520

In [99]:
df9.smoker=df9.smoker.replace(['yes','no'],[0,1])
df9.head()

   age  sex     bmi  children  smoker     region      charges
0   19    1  27.900         0       0  southwest  16884.92400
1   18    2  33.770         1       1  southeast   1725.55230
2   28    2  33.000         3       1  southeast   4449.46200
3   33    2  22.705         0       1  northwest  21984.47061
4   32    2  28.880         0       1  northwest   3866.85520

In [100]:
df9.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [101]:
df9.region=df9.region.replace(['southwest', 'southeast', 'northwest', 'northeast'],[1,2,3,4])
df9.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       0       1  16884.92400
1   18    2  33.770         1       1       2   1725.55230
2   28    2  33.000         3       1       2   4449.46200
3   33    2  22.705         0       1       3  21984.47061
4   32    2  28.880         0       1       3   3866.85520